app/controllers/reviews_controller.rb

INSERT INTO "reviews" ("rating", "comment", "created_at", "updated_at", "user_id", "movie_id") VALUES (?, ?, ?, ?, ?, ?)  [["rating", 5], ["comment", "This was a super cool movie !"], ["created_at", 2017-03-12 13:49:46 UTC], ["updated_at", 2017-03-12 13:49:46 UTC], ["user_id", 1], ["movie_id", 1]]
---
  def create
    @review = Review.new(review_params)
    @review.user_id = current_user.id

    respond_to do |format|
      if @review.save